
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7674690620)


<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_project_iam_member.backend-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]
  * google_project_service.backend-api-resources[&#34;secretmanager.googleapis.com&#34;]
  * google_secret_manager_secret.backend-sa-secret[&#34;weather_api_key&#34;]
* Update
  * google_artifact_registry_repository.artifact-repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "backend-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_service.backend-api-resources["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "backend-api-resources" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "secretmanager.googleapis.com"
    }

  # google_secret_manager_secret.backend-sa-secret["weather_api_key"] will be created
  + resource "google_secret_manager_secret" "backend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "weather_api_key"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":26,"Program":"tfcmt","SHA1":"6fb8e74cbd00a39bb2a820a57770ed91dc155902","Vars":{},"WorkflowName":"iaac_plan"} -->